/*******************************************************************************
 * Size: 14 px
 * Bpp: 1
 * Opts: --bpp 1 --size 14 --no-compress --stride 1 --align 1 --font Roboto-Regular.ttf --symbols ̉ ̃ ́ ̣ ̈́ - ‐ ‑ – — , ; : ! ? . … ' ‘ ’ " “ ” ( ) [ ] § @ * / & # % ‰ † ‡ ′ ″ ΅ ῎ ῞ + 0 1 2 3 4 5 6 7 8 9 a A à À ả Ả ã Ã á Á ạ Ạ ǻ Ǻ ǽ Ǽ ă Ă ằ Ằ ẳ Ẳ ẵ Ẵ ắ Ắ ặ Ặ ą̆ Ą̆ ḁ̆ Ḁ̆ â Â ầ Ầ ẩ Ẩ ẫ Ẫ ấ Ấ ậ Ậ ą̂ Ą̂ ḁ̂ Ḁ̂ b B ḅ Ḅ c C ć Ć ḉ Ḉ d D ḍ Ḍ đ Đ e E è È ẻ Ẻ ẽ Ẽ é É ẹ Ẹ ḗ Ḗ ê Ê ề Ề ể Ể ễ Ễ ế Ế ệ Ệ ȩ̂ Ȩ̂ ę̂ Ę̂ ḙ̂ Ḙ̂ ḛ̂ Ḛ̂ f F g G ǵ Ǵ h H ḥ Ḥ i I ì Ì ỉ Ỉ ĩ Ĩ í Í ị Ị ḯ Ḯ j J k K ḱ Ḱ ḳ Ḳ l L ĺ Ĺ ḷ Ḷ ḹ Ḹ m M ḿ Ḿ ṃ Ṃ n N ñ Ñ ń Ń ṇ Ṇ o O ò Ò ỏ Ỏ õ Õ ṍ Ṍ ṏ Ṏ ȭ Ȭ ó Ó ọ Ọ ǿ Ǿ ṓ Ṓ ô Ô ồ Ồ ổ Ổ ỗ Ỗ ố Ố ộ Ộ ǫ̂ Ǫ̂ ơ̂ Ơ̂ ợ̂ Ợ̂ ơ Ơ ờ Ờ ở Ở ỡ Ỡ ớ Ớ ợ Ợ ǫ̛ Ǫ̛ p P ṕ Ṕ q Q r R ŕ Ŕ ṛ Ṛ ṝ Ṝ s S ś Ś ṥ Ṥ ṣ Ṣ ṩ Ṩ t T ṭ Ṭ u U ù Ù ủ Ủ ũ Ũ ṹ Ṹ ú Ú ụ Ụ ǘ Ǘ ư Ư ừ Ừ ử Ử ữ Ữ ứ Ứ ự Ự ų̛ Ų̛ v V ṽ Ṽ ṿ Ṿ w W ẃ Ẃ ẉ Ẉ x X y Y ỳ Ỳ ỷ Ỷ ỹ Ỹ ý Ý ỵ Ỵ z Z ź Ź ẓ Ẓ ἄ Ἄ ᾄ ᾌ ἅ Ἅ ᾅ ᾍ ά Ά ᾴ ἔ Ἔ ἕ Ἕ έ Έ ἤ Ἤ ᾔ ᾜ ἥ Ἥ ᾕ ᾝ ή Ή ῄ ἴ Ἴ ἵ Ἵ ί Ί ΐ ὄ Ὄ ὅ Ὅ ό Ό ὔ ὕ Ὕ ύ Ύ ϓ ΰ ὤ Ὤ ᾤ ᾬ ὥ Ὥ ᾥ ᾭ ώ Ώ ῴ ѓ Ѓ ќ Ќ --range 0-255 --format lvgl -o roboto_regular_14.c
 ******************************************************************************/

#ifdef __has_include
#if __has_include("lvgl.h")
#ifndef LV_LVGL_H_INCLUDE_SIMPLE
#define LV_LVGL_H_INCLUDE_SIMPLE
#endif
#endif
#endif

#ifdef LV_LVGL_H_INCLUDE_SIMPLE
#include "lvgl.h"
#else
#include "lvgl/lvgl.h"
#endif

#ifndef ROBOTO_REGULAR_14
#define ROBOTO_REGULAR_14 1
#endif

#if ROBOTO_REGULAR_14

/*-----------------
 *    BITMAPS
 *----------------*/

/*Store the image of the glyphs*/
static LV_ATTRIBUTE_LARGE_CONST const uint8_t glyph_bitmap[] = {
    /* U+0000 "\u0000" */
    0x0,

    /* U+0002 "\u0002" */
    0x0,

    /* U+000D "\r" */
    0x0,

    /* U+0020 " " */
    0x0,

    /* U+0021 "!" */
    0xfe, 0x20,

    /* U+0022 "\"" */
    0xb6, 0x80,

    /* U+0023 "#" */
    0x12, 0x14, 0x14, 0x7f, 0x24, 0x24, 0x24, 0xfe,
    0x28, 0x28, 0x28,

    /* U+0024 "$" */
    0x10, 0x43, 0x9f, 0x45, 0x16, 0x4, 0xe, 0x18,
    0x7f, 0x78, 0x41, 0x0,

    /* U+0025 "%" */
    0x60, 0x49, 0x24, 0x92, 0x86, 0x40, 0x40, 0x4c,
    0x29, 0x24, 0x92, 0x40, 0xc0,

    /* U+0026 "&" */
    0x38, 0x44, 0x44, 0x4c, 0x38, 0x70, 0xd2, 0x8a,
    0x8e, 0xce, 0x7a,

    /* U+0027 "'" */
    0xe0,

    /* U+0028 "(" */
    0x5, 0x29, 0x24, 0x92, 0x24, 0x88,

    /* U+0029 ")" */
    0x11, 0x22, 0x49, 0x24, 0xa4, 0xa0,

    /* U+002A "*" */
    0x21, 0x3e, 0x45, 0x6c,

    /* U+002B "+" */
    0x10, 0x20, 0x40, 0x8f, 0xe2, 0x4, 0x8, 0x10,

    /* U+002C "," */
    0x54,

    /* U+002D "-" */
    0xe0,

    /* U+002E "." */
    0x80,

    /* U+002F "/" */
    0x8, 0x44, 0x21, 0x10, 0x84, 0x42, 0x31, 0x0,

    /* U+0030 "0" */
    0x79, 0x28, 0x61, 0x86, 0x18, 0x61, 0x85, 0x27,
    0x80,

    /* U+0031 "1" */
    0x1f, 0x91, 0x11, 0x11, 0x11, 0x10,

    /* U+0032 "2" */
    0x79, 0x9a, 0x10, 0x20, 0x41, 0x4, 0x18, 0x60,
    0x83, 0xf8,

    /* U+0033 "3" */
    0x7b, 0x18, 0x41, 0xc, 0xe0, 0xc1, 0x87, 0x37,
    0x80,

    /* U+0034 "4" */
    0x4, 0x18, 0x50, 0xa2, 0x44, 0x91, 0x7f, 0x4,
    0x8, 0x10,

    /* U+0035 "5" */
    0x7d, 0x4, 0x10, 0xf9, 0x30, 0x41, 0x87, 0x37,
    0x80,

    /* U+0036 "6" */
    0x39, 0x84, 0x20, 0xbb, 0x38, 0x61, 0x85, 0x37,
    0x80,

    /* U+0037 "7" */
    0xfe, 0xc, 0x10, 0x20, 0x81, 0x6, 0x8, 0x30,
    0x40, 0x80,

    /* U+0038 "8" */
    0x7b, 0x38, 0x61, 0xcd, 0xec, 0xe1, 0x87, 0x37,
    0x80,

    /* U+0039 "9" */
    0x73, 0x28, 0x61, 0x87, 0x37, 0x41, 0x8, 0x67,
    0x0,

    /* U+003A ":" */
    0x81,

    /* U+003B ";" */
    0x87, 0x80,

    /* U+003C "<" */
    0x4, 0x66, 0x30, 0x70, 0x70, 0x40,

    /* U+003D "=" */
    0xfc, 0x0, 0x3f,

    /* U+003E ">" */
    0x83, 0x81, 0x83, 0x3b, 0x0, 0x0,

    /* U+003F "?" */
    0x76, 0x62, 0x11, 0x88, 0x84, 0x0, 0x8,

    /* U+0040 "@" */
    0xf, 0x6, 0x11, 0x1, 0x27, 0x38, 0x93, 0x22,
    0x64, 0x4c, 0x91, 0x92, 0x32, 0x6b, 0x37, 0x20,
    0x2, 0x0, 0x3c, 0x0,

    /* U+0041 "A" */
    0xc, 0x7, 0x1, 0xc0, 0x58, 0x36, 0xc, 0x82,
    0x31, 0xfc, 0x61, 0x90, 0x24, 0x8,

    /* U+0042 "B" */
    0xf9, 0xa, 0x14, 0x28, 0xdf, 0x21, 0xc1, 0x83,
    0xf, 0xf0,

    /* U+0043 "C" */
    0x3c, 0x8e, 0xc, 0x18, 0x10, 0x20, 0x40, 0x82,
    0x8c, 0xf0,

    /* U+0044 "D" */
    0xf9, 0x1a, 0x14, 0x18, 0x30, 0x60, 0xc1, 0x85,
    0x1b, 0xe0,

    /* U+0045 "E" */
    0xfe, 0x8, 0x20, 0x83, 0xe8, 0x20, 0x82, 0xf,
    0xc0,

    /* U+0046 "F" */
    0xfe, 0x8, 0x20, 0x83, 0xe8, 0x20, 0x82, 0x8,
    0x0,

    /* U+0047 "G" */
    0x3c, 0x42, 0xc1, 0x80, 0x80, 0x80, 0x8f, 0x81,
    0xc1, 0x61, 0x3e,

    /* U+0048 "H" */
    0x81, 0x81, 0x81, 0x81, 0x81, 0xff, 0x81, 0x81,
    0x81, 0x81, 0x81,

    /* U+0049 "I" */
    0xff, 0xe0,

    /* U+004A "J" */
    0x4, 0x10, 0x41, 0x4, 0x10, 0x41, 0x87, 0x37,
    0x80,

    /* U+004B "K" */
    0x87, 0x1a, 0x64, 0x8a, 0x1e, 0x34, 0x4c, 0x8d,
    0xa, 0x18,

    /* U+004C "L" */
    0x82, 0x8, 0x20, 0x82, 0x8, 0x20, 0x82, 0xf,
    0xc0,

    /* U+004D "M" */
    0xc0, 0xf0, 0x3c, 0xe, 0x85, 0xa1, 0x6c, 0xd9,
    0x26, 0x49, 0x8c, 0x63, 0x18, 0xc4,

    /* U+004E "N" */
    0x81, 0xc1, 0xe1, 0xa1, 0xb1, 0x99, 0x8d, 0x8d,
    0x87, 0x83, 0x81,

    /* U+004F "O" */
    0x3c, 0x42, 0xc3, 0x81, 0x81, 0x81, 0x81, 0x81,
    0xc3, 0x42, 0x3c,

    /* U+0050 "P" */
    0xfd, 0xa, 0xc, 0x18, 0x30, 0xff, 0x40, 0x81,
    0x2, 0x0,

    /* U+0051 "Q" */
    0x3c, 0x42, 0xc3, 0x81, 0x81, 0x81, 0x81, 0x81,
    0xc3, 0x42, 0x3e, 0x3, 0x0,

    /* U+0052 "R" */
    0xfd, 0xe, 0xc, 0x18, 0x30, 0xbe, 0x46, 0x85,
    0xe, 0x8,

    /* U+0053 "S" */
    0x3c, 0x62, 0x41, 0x40, 0x70, 0x1c, 0x7, 0x1,
    0x41, 0x63, 0x3e,

    /* U+0054 "T" */
    0xfe, 0x20, 0x40, 0x81, 0x2, 0x4, 0x8, 0x10,
    0x20, 0x40,

    /* U+0055 "U" */
    0x83, 0x6, 0xc, 0x18, 0x30, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+0056 "V" */
    0xc1, 0xa0, 0x90, 0x4c, 0x62, 0x21, 0x10, 0xd8,
    0x28, 0x14, 0xe, 0x2, 0x0,

    /* U+0057 "W" */
    0x42, 0x14, 0x63, 0x46, 0x34, 0x52, 0x65, 0x22,
    0xd2, 0x29, 0x62, 0x8c, 0x28, 0xc3, 0xc, 0x10,
    0xc0,

    /* U+0058 "X" */
    0x43, 0x62, 0x26, 0x34, 0x1c, 0x8, 0x1c, 0x34,
    0x26, 0x63, 0x41,

    /* U+0059 "Y" */
    0x83, 0x8d, 0x13, 0x62, 0x87, 0x4, 0x8, 0x10,
    0x20, 0x40,

    /* U+005A "Z" */
    0xfe, 0xc, 0x30, 0x41, 0x82, 0x8, 0x30, 0x41,
    0x3, 0xf8,

    /* U+005B "[" */
    0xea, 0xaa, 0xaa, 0xb0,

    /* U+005C "\\" */
    0xc1, 0x4, 0x8, 0x20, 0x81, 0x4, 0x18, 0x20,
    0x83,

    /* U+005D "]" */
    0xd5, 0x55, 0x55, 0x70,

    /* U+005E "^" */
    0x21, 0x8c, 0xe4, 0xa4,

    /* U+005F "_" */
    0xfc,

    /* U+0060 "`" */
    0x44,

    /* U+0061 "a" */
    0x7b, 0x10, 0x5f, 0xc6, 0x18, 0xdd,

    /* U+0062 "b" */
    0x82, 0x8, 0x2e, 0xce, 0x18, 0x61, 0x87, 0x3b,
    0x80,

    /* U+0063 "c" */
    0x79, 0x38, 0x60, 0x82, 0x14, 0xde,

    /* U+0064 "d" */
    0x4, 0x10, 0x5d, 0xce, 0x18, 0x61, 0x85, 0x37,
    0x40,

    /* U+0065 "e" */
    0x39, 0x38, 0x7f, 0x82, 0x4, 0x5e,

    /* U+0066 "f" */
    0x3a, 0x11, 0xe4, 0x21, 0x8, 0x42, 0x10,

    /* U+0067 "g" */
    0x77, 0x38, 0x61, 0x86, 0x14, 0xdd, 0x6, 0x37,
    0x80,

    /* U+0068 "h" */
    0x82, 0x8, 0x2e, 0xc6, 0x18, 0x61, 0x86, 0x18,
    0x40,

    /* U+0069 "i" */
    0x9f, 0xe0,

    /* U+006A "j" */
    0x20, 0x12, 0x49, 0x24, 0x93, 0x80,

    /* U+006B "k" */
    0x82, 0x8, 0x22, 0x92, 0x8e, 0x38, 0x92, 0x68,
    0xc0,

    /* U+006C "l" */
    0xff, 0xe0,

    /* U+006D "m" */
    0xb9, 0xd8, 0xc6, 0x10, 0xc2, 0x18, 0x43, 0x8,
    0x61, 0xc, 0x21,

    /* U+006E "n" */
    0xbb, 0x18, 0x61, 0x86, 0x18, 0x61,

    /* U+006F "o" */
    0x38, 0x8a, 0xc, 0x18, 0x30, 0x51, 0x1c,

    /* U+0070 "p" */
    0xbb, 0x38, 0x61, 0x86, 0x18, 0xbe, 0x82, 0x8,
    0x0,

    /* U+0071 "q" */
    0x77, 0x38, 0x61, 0x86, 0x1c, 0xdd, 0x4, 0x10,
    0x40,

    /* U+0072 "r" */
    0xfa, 0x49, 0x24,

    /* U+0073 "s" */
    0x39, 0x14, 0x1c, 0x1c, 0x14, 0x4e,

    /* U+0074 "t" */
    0x4b, 0xa4, 0x92, 0x4c,

    /* U+0075 "u" */
    0x86, 0x18, 0x61, 0x86, 0x18, 0xdf,

    /* U+0076 "v" */
    0xc4, 0x89, 0x33, 0x42, 0x85, 0xc, 0x8,

    /* U+0077 "w" */
    0xc4, 0x53, 0x14, 0xcd, 0x2a, 0x72, 0x8c, 0xa3,
    0x10, 0xc4,

    /* U+0078 "x" */
    0x44, 0xd8, 0xa1, 0x83, 0x5, 0x1b, 0x22,

    /* U+0079 "y" */
    0xc5, 0x14, 0xda, 0x28, 0xa3, 0x4, 0x10, 0x86,
    0x0,

    /* U+007A "z" */
    0xfc, 0x31, 0x8c, 0x31, 0x8c, 0x3f,

    /* U+007B "{" */
    0x5, 0x24, 0x94, 0x49, 0x24, 0x40,

    /* U+007C "|" */
    0xff, 0xf8,

    /* U+007D "}" */
    0x99, 0x24, 0x99, 0x69, 0x25, 0xa0,

    /* U+007E "~" */
    0x71, 0x9b, 0x8e,

    /* U+00A0 " " */
    0x0,

    /* U+00A1 "¡" */
    0x9f, 0xc0,

    /* U+00A2 "¢" */
    0x10, 0x47, 0x9f, 0x86, 0x8, 0x21, 0x7d, 0xe1,
    0x4,

    /* U+00A3 "£" */
    0x3c, 0xcd, 0x1a, 0x4, 0x1e, 0x10, 0x20, 0x40,
    0x83, 0xf8,

    /* U+00A4 "¤" */
    0xbd, 0x43, 0xc3, 0x81, 0x81, 0x81, 0xc3, 0xc3,
    0xbd,

    /* U+00A5 "¥" */
    0xc6, 0x89, 0x11, 0x42, 0x87, 0x1f, 0x8, 0x7c,
    0x20, 0x40,

    /* U+00A6 "¦" */
    0xfb, 0xf0,

    /* U+00A7 "§" */
    0x7d, 0x8e, 0xc, 0x7, 0x13, 0xa1, 0xc1, 0x72,
    0x38, 0xc, 0x1c, 0x6f, 0x80,

    /* U+00A8 "¨" */
    0x90,

    /* U+00A9 "©" */
    0x1e, 0x8, 0x45, 0xca, 0x89, 0xa0, 0x68, 0x1a,
    0x6, 0x89, 0x5c, 0x88, 0x41, 0xe0,

    /* U+00AA "ª" */
    0x79, 0xf9, 0xf0,

    /* U+00AB "«" */
    0x4a, 0xa9, 0x45, 0x24,

    /* U+00AC "¬" */
    0xfc, 0x10, 0x40,

    /* U+00AD "­" */
    0xe0,

    /* U+00AE "®" */
    0x1e, 0x8, 0x45, 0xca, 0x49, 0x92, 0x67, 0x99,
    0x26, 0x49, 0x40, 0x88, 0x41, 0xe0,

    /* U+00AF "¯" */
    0xf8,

    /* U+00B0 "°" */
    0x69, 0x96,

    /* U+00B1 "±" */
    0x20, 0x82, 0x3f, 0x20, 0x82, 0x0, 0xfc,

    /* U+00B2 "²" */
    0xf9, 0x24, 0xf0,

    /* U+00B3 "³" */
    0xf1, 0x71, 0xf0,

    /* U+00B4 "´" */
    0x50,

    /* U+00B5 "µ" */
    0x86, 0x18, 0x61, 0x86, 0x18, 0x7f, 0x82, 0x8,
    0x0,

    /* U+00B6 "¶" */
    0x7f, 0xff, 0xff, 0xfd, 0xe1, 0x8, 0x42,

    /* U+00B7 "·" */
    0x80,

    /* U+00B8 "¸" */
    0x9c,

    /* U+00B9 "¹" */
    0xd5, 0x40,

    /* U+00BA "º" */
    0x74, 0x63, 0x17, 0x0,

    /* U+00BB "»" */
    0xa2, 0x92, 0x95, 0x50,

    /* U+00BC "¼" */
    0xc0, 0x21, 0x11, 0x9, 0x84, 0x92, 0x98, 0x4c,
    0x4a, 0x6f, 0x80, 0x80,

    /* U+00BD "½" */
    0x40, 0x60, 0x11, 0x8, 0x84, 0x82, 0x98, 0x52,
    0x41, 0x21, 0x21, 0x1, 0xe0,

    /* U+00BE "¾" */
    0xf0, 0x4, 0x47, 0x22, 0x48, 0xf4, 0x81, 0x60,
    0xa8, 0x4a, 0x17, 0xc0, 0x20,

    /* U+00BF "¿" */
    0x20, 0x0, 0x8, 0x21, 0xc, 0x20, 0x8e, 0x27,
    0x0,

    /* U+00C0 "À" */
    0x10, 0x6, 0x0, 0xc0, 0x30, 0x1c, 0x7, 0x1,
    0x60, 0xd8, 0x32, 0x8, 0xc7, 0xf1, 0x86, 0x40,
    0x90, 0x20,

    /* U+00C1 "Á" */
    0x6, 0x1, 0x0, 0x80, 0x30, 0x1c, 0x7, 0x1,
    0x60, 0xd8, 0x32, 0x8, 0xc7, 0xf1, 0x86, 0x40,
    0x90, 0x20,

    /* U+00C2 "Â" */
    0x8, 0x5, 0x0, 0x20, 0x30, 0x1c, 0x7, 0x1,
    0x60, 0xd8, 0x32, 0x8, 0xc7, 0xf1, 0x86, 0x40,
    0x90, 0x20,

    /* U+00C3 "Ã" */
    0x1a, 0x9, 0x80, 0xc0, 0x70, 0x1c, 0x5, 0x83,
    0x60, 0xc8, 0x23, 0x1f, 0xc6, 0x19, 0x2, 0x40,
    0x80,

    /* U+00C4 "Ä" */
    0x12, 0x0, 0x0, 0xc0, 0x70, 0x1c, 0x5, 0x81,
    0x60, 0xcc, 0x23, 0xf, 0xc6, 0x19, 0x2, 0x40,
    0x80,

    /* U+00C5 "Å" */
    0x1c, 0x5, 0x1, 0xc0, 0x20, 0x1c, 0x7, 0x1,
    0x40, 0x58, 0x32, 0x8, 0xc3, 0xf1, 0x84, 0x40,
    0x90, 0x20,

    /* U+00C6 "Æ" */
    0x3, 0xf8, 0x38, 0x1, 0x40, 0x1a, 0x0, 0x90,
    0xc, 0xf8, 0x44, 0x7, 0xe0, 0x21, 0x3, 0x8,
    0x10, 0x7e,

    /* U+00C7 "Ç" */
    0x3c, 0x42, 0xc3, 0x81, 0x80, 0x80, 0x80, 0x80,
    0x83, 0x42, 0x3c, 0x18, 0x8, 0x18,

    /* U+00C8 "È" */
    0x40, 0x82, 0x3f, 0x82, 0x8, 0x20, 0xfa, 0x8,
    0x20, 0x83, 0xf0,

    /* U+00C9 "É" */
    0x18, 0x42, 0x3f, 0x82, 0x8, 0x20, 0xfa, 0x8,
    0x20, 0x83, 0xf0,

    /* U+00CA "Ê" */
    0x20, 0xc4, 0xbf, 0x82, 0x8, 0x20, 0xfa, 0x8,
    0x20, 0x83, 0xf0,

    /* U+00CB "Ë" */
    0x48, 0xf, 0xe0, 0x82, 0x8, 0x3e, 0x82, 0x8,
    0x20, 0xfc,

    /* U+00CC "Ì" */
    0xb5, 0x55, 0x55, 0x50,

    /* U+00CD "Í" */
    0x7a, 0xaa, 0xaa, 0xa0,

    /* U+00CE "Î" */
    0x56, 0xa4, 0x92, 0x49, 0x24, 0x80,

    /* U+00CF "Ï" */
    0x90, 0x22, 0x22, 0x22, 0x22, 0x22, 0x20,

    /* U+00D0 "Ð" */
    0x7c, 0x46, 0x42, 0x41, 0x41, 0xf1, 0x41, 0x41,
    0x42, 0x46, 0x7c,

    /* U+00D1 "Ñ" */
    0x32, 0x4c, 0x81, 0xc1, 0xe1, 0xa1, 0xb1, 0x99,
    0x8d, 0x8d, 0x87, 0x83, 0x81,

    /* U+00D2 "Ò" */
    0x20, 0x10, 0x8, 0x3c, 0x42, 0xc3, 0x81, 0x81,
    0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+00D3 "Ó" */
    0x4, 0x8, 0x10, 0x3c, 0x42, 0xc3, 0x81, 0x81,
    0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+00D4 "Ô" */
    0x0, 0x18, 0x24, 0x3c, 0x42, 0xc3, 0x81, 0x81,
    0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+00D5 "Õ" */
    0x3c, 0x0, 0x3c, 0x42, 0xc3, 0x81, 0x81, 0x81,
    0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+00D6 "Ö" */
    0x24, 0x0, 0x3c, 0x42, 0xc3, 0x81, 0x81, 0x81,
    0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+00D7 "×" */
    0x8f, 0x67, 0xc, 0x5a, 0x30, 0x0,

    /* U+00D8 "Ø" */
    0x3d, 0x42, 0xc3, 0x85, 0x89, 0x89, 0x91, 0xa1,
    0xe3, 0x42, 0x7c, 0x80,

    /* U+00D9 "Ù" */
    0x60, 0x60, 0x44, 0x18, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xc, 0x14, 0x47, 0x0,

    /* U+00DA "Ú" */
    0xc, 0x30, 0x44, 0x18, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xc, 0x14, 0x47, 0x0,

    /* U+00DB "Û" */
    0x10, 0x51, 0x14, 0x18, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xc, 0x14, 0x47, 0x0,

    /* U+00DC "Ü" */
    0x24, 0x2, 0xc, 0x18, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xa, 0x23, 0x80,

    /* U+00DD "Ý" */
    0xc, 0x30, 0x44, 0x1c, 0x68, 0x9b, 0x14, 0x38,
    0x20, 0x40, 0x81, 0x2, 0x0,

    /* U+00DE "Þ" */
    0x82, 0x8, 0x3e, 0x8e, 0x18, 0x63, 0xfa, 0x8,
    0x0,

    /* U+00DF "ß" */
    0x71, 0x12, 0x24, 0x49, 0x12, 0x22, 0x43, 0x83,
    0x6, 0xf0,

    /* U+00E0 "à" */
    0x60, 0xc0, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+00E1 "á" */
    0x8, 0x40, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+00E2 "â" */
    0x31, 0xa0, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+00E3 "ã" */
    0x65, 0x60, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+00E4 "ä" */
    0x48, 0x0, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+00E5 "å" */
    0x38, 0xa3, 0x80, 0x7b, 0x10, 0x5f, 0xc6, 0x18,
    0xdd,

    /* U+00E6 "æ" */
    0x7b, 0xb1, 0x90, 0x45, 0xff, 0xc4, 0x21, 0x8,
    0xe5, 0xef,

    /* U+00E7 "ç" */
    0x79, 0x38, 0x60, 0x82, 0x14, 0xde, 0x30, 0x43,
    0x0,

    /* U+00E8 "è" */
    0x60, 0x80, 0xe, 0x4e, 0x1f, 0xe0, 0x81, 0x17,
    0x80,

    /* U+00E9 "é" */
    0x18, 0x40, 0xe, 0x4e, 0x1f, 0xe0, 0x81, 0x17,
    0x80,

    /* U+00EA "ê" */
    0x31, 0x20, 0xe, 0x4e, 0x1f, 0xe0, 0x81, 0x17,
    0x80,

    /* U+00EB "ë" */
    0x48, 0x0, 0xe, 0x4e, 0x1f, 0xe0, 0x81, 0x37,
    0x80,

    /* U+00EC "ì" */
    0x91, 0x55, 0x54,

    /* U+00ED "í" */
    0x50, 0x49, 0x24, 0x92, 0x0,

    /* U+00EE "î" */
    0x54, 0x24, 0x92, 0x49, 0x0,

    /* U+00EF "ï" */
    0x90, 0x2, 0x22, 0x22, 0x22, 0x20,

    /* U+00F0 "ð" */
    0x60, 0xe2, 0x82, 0x77, 0x38, 0x61, 0x87, 0x27,
    0x80,

    /* U+00F1 "ñ" */
    0x66, 0x60, 0x2e, 0xc6, 0x18, 0x61, 0x86, 0x18,
    0x40,

    /* U+00F2 "ò" */
    0x60, 0x60, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+00F3 "ó" */
    0x8, 0x20, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+00F4 "ô" */
    0x30, 0xd0, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+00F5 "õ" */
    0x74, 0xb8, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+00F6 "ö" */
    0x48, 0x0, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+00F7 "÷" */
    0x10, 0x0, 0x7, 0xf0, 0x0, 0x4, 0x0,

    /* U+00F8 "ø" */
    0x4, 0x79, 0x34, 0x59, 0x32, 0x68, 0xb2, 0x78,
    0x80,

    /* U+00F9 "ù" */
    0x60, 0xc0, 0x21, 0x86, 0x18, 0x61, 0x86, 0x37,
    0xc0,

    /* U+00FA "ú" */
    0x18, 0x40, 0x21, 0x86, 0x18, 0x61, 0x86, 0x37,
    0xc0,

    /* U+00FB "û" */
    0x31, 0x20, 0x21, 0x86, 0x18, 0x61, 0x86, 0x37,
    0xc0,

    /* U+00FC "ü" */
    0x48, 0x0, 0x21, 0x86, 0x18, 0x61, 0x86, 0x37,
    0x40,

    /* U+00FD "ý" */
    0x8, 0x40, 0x31, 0x45, 0x36, 0x8a, 0x28, 0xc1,
    0x4, 0x21, 0x80,

    /* U+00FE "þ" */
    0x82, 0x8, 0x2e, 0xce, 0x18, 0x61, 0x86, 0x2f,
    0xa0, 0x82, 0x0,

    /* U+00FF "ÿ" */
    0x48, 0x0, 0x23, 0xc9, 0x24, 0x9c, 0x70, 0xc2,
    0x8, 0x23, 0x0,

    /* U+0102 "Ă" */
    0x14, 0x6, 0x0, 0x80, 0x70, 0x1c, 0x5, 0x83,
    0x60, 0xc8, 0x23, 0x1f, 0xc6, 0x19, 0x2, 0x40,
    0x80,

    /* U+0103 "ă" */
    0x48, 0xe0, 0x1e, 0x84, 0x17, 0xf1, 0x86, 0x37,
    0x40,

    /* U+0104 "Ą" */
    0xc, 0x7, 0x1, 0xc0, 0x58, 0x36, 0xc, 0x82,
    0x31, 0xfc, 0x61, 0x90, 0x24, 0x8, 0x6, 0x1,
    0x0, 0x60,

    /* U+0105 "ą" */
    0x7b, 0x10, 0x5f, 0xc6, 0x18, 0xdd, 0x8, 0x20,
    0xc0,

    /* U+0106 "Ć" */
    0x8, 0x30, 0x41, 0xe4, 0x70, 0x60, 0xc0, 0x81,
    0x2, 0x4, 0x14, 0x67, 0x80,

    /* U+0107 "ć" */
    0x10, 0xc0, 0x1e, 0x4e, 0x18, 0x20, 0x85, 0x37,
    0x80,

    /* U+0110 "Đ" */
    0x7c, 0x46, 0x42, 0x41, 0x41, 0xf1, 0x41, 0x41,
    0x42, 0x46, 0x7c,

    /* U+0111 "đ" */
    0x4, 0x3c, 0x13, 0xac, 0xd0, 0xa1, 0x42, 0x84,
    0x99, 0xd0,

    /* U+0118 "Ę" */
    0xfe, 0x8, 0x20, 0x83, 0xf8, 0x20, 0x82, 0xf,
    0xc2, 0x18, 0x30,

    /* U+0119 "ę" */
    0x39, 0x38, 0x7f, 0x82, 0x4, 0x5e, 0x10, 0xc1,
    0x80,

    /* U+0128 "Ĩ" */
    0xf8, 0x8, 0x42, 0x10, 0x84, 0x21, 0x8, 0x42,
    0x0,

    /* U+0129 "ĩ" */
    0x4d, 0x80, 0x42, 0x10, 0x84, 0x21, 0x8,

    /* U+0139 "Ĺ" */
    0x41, 0x8, 0x20, 0x82, 0x8, 0x20, 0x82, 0x8,
    0x20, 0x83, 0xf0,

    /* U+013A "ĺ" */
    0x50, 0x49, 0x24, 0x92, 0x49, 0x0,

    /* U+0143 "Ń" */
    0x6, 0x8, 0x10, 0x81, 0xc1, 0xe1, 0xa1, 0xb1,
    0x99, 0x8d, 0x8d, 0x87, 0x83, 0x81,

    /* U+0144 "ń" */
    0x18, 0x40, 0x2e, 0xc6, 0x18, 0x61, 0x86, 0x18,
    0x40,

    /* U+0154 "Ŕ" */
    0xc, 0x30, 0x87, 0xe8, 0x70, 0x60, 0xc1, 0x85,
    0xf2, 0x34, 0x28, 0x70, 0x40,

    /* U+0155 "ŕ" */
    0x24, 0xe, 0xc8, 0x88, 0x88, 0x80,

    /* U+015A "Ś" */
    0x6, 0xc, 0x8, 0x3c, 0x62, 0x41, 0x40, 0x70,
    0x1c, 0x7, 0x1, 0x41, 0x63, 0x3e,

    /* U+015B "ś" */
    0x8, 0x40, 0xe, 0x45, 0x7, 0x7, 0x45, 0x13,
    0x80,

    /* U+0168 "Ũ" */
    0x7c, 0x2, 0xc, 0x18, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xa, 0x23, 0x80,

    /* U+0169 "ũ" */
    0x66, 0x60, 0x21, 0x86, 0x18, 0x61, 0x86, 0x37,
    0xc0,

    /* U+0172 "Ų" */
    0x83, 0x6, 0xc, 0x18, 0x30, 0x60, 0xc1, 0x82,
    0x88, 0xe0, 0xc1, 0x3, 0x80,

    /* U+0173 "ų" */
    0x86, 0x18, 0x61, 0x86, 0x18, 0xdf, 0x8, 0x20,
    0xc0,

    /* U+0179 "Ź" */
    0x8, 0x20, 0x87, 0xf0, 0x61, 0x82, 0xc, 0x10,
    0x41, 0x82, 0x8, 0x1f, 0xc0,

    /* U+017A "ź" */
    0x18, 0x40, 0x3f, 0xc, 0x63, 0xc, 0x63, 0xf,
    0xc0,

    /* U+01A0 "Ơ" */
    0x0, 0x9e, 0x50, 0xd8, 0x68, 0x14, 0xa, 0x5,
    0x2, 0x81, 0x61, 0x90, 0x87, 0x80,

    /* U+01A1 "ơ" */
    0x2, 0x3a, 0x46, 0x82, 0x82, 0x82, 0x82, 0x44,
    0x38,

    /* U+01AF "Ư" */
    0x82, 0x60, 0x98, 0x3a, 0x8, 0x82, 0x20, 0x88,
    0x22, 0x8, 0x82, 0x11, 0x3, 0x80,

    /* U+01B0 "ư" */
    0x1, 0x85, 0x86, 0x84, 0x84, 0x84, 0x84, 0x8c,
    0x7c,

    /* U+01FA "Ǻ" */
    0x4, 0x3, 0x1, 0x40, 0x30, 0x1c, 0x7, 0x1,
    0x60, 0xd8, 0x32, 0x8, 0xc7, 0xf1, 0x86, 0x40,
    0x90, 0x20,

    /* U+01FB "ǻ" */
    0x8, 0xc3, 0x96, 0x7b, 0x10, 0x5f, 0xc6, 0x18,
    0xdd,

    /* U+01FC "Ǽ" */
    0x1, 0x80, 0x8, 0x0, 0x80, 0x7, 0xf0, 0x70,
    0x2, 0x80, 0x34, 0x1, 0x20, 0x19, 0xf0, 0x88,
    0xf, 0xc0, 0x42, 0x6, 0x10, 0x20, 0xfc,

    /* U+01FD "ǽ" */
    0x2, 0x1, 0x0, 0x1, 0xee, 0xc6, 0x41, 0x17,
    0xff, 0x10, 0x84, 0x23, 0x97, 0xbc,

    /* U+01FE "Ǿ" */
    0xc, 0x8, 0x0, 0x3d, 0x42, 0xc3, 0x85, 0x89,
    0x89, 0x91, 0xa1, 0xe3, 0x42, 0x7c, 0x80,

    /* U+01FF "ǿ" */
    0x18, 0x20, 0x1, 0xe4, 0x51, 0x64, 0xc9, 0xa2,
    0xc9, 0xe2, 0x0,

    /* U+0301 "́" */
    0x68,

    /* U+0303 "̃" */
    0xcd, 0x80,

    /* U+0309 "̉" */
    0xd8,

    /* U+0323 "̣" */
    0x80,

    /* U+0385 "΅" */
    0x31, 0x22,

    /* U+0386 "Ά" */
    0x2c, 0x17, 0x1, 0xc0, 0x58, 0x36, 0xc, 0x82,
    0x31, 0xfc, 0x61, 0x90, 0x24, 0x8,

    /* U+0388 "Έ" */
    0x5f, 0xc8, 0x4, 0x2, 0x1, 0x0, 0xf8, 0x40,
    0x20, 0x10, 0x8, 0x7, 0xe0,

    /* U+0389 "Ή" */
    0x50, 0x64, 0x11, 0x4, 0x41, 0x10, 0x47, 0xf1,
    0x4, 0x41, 0x10, 0x44, 0x11, 0x4,

    /* U+038A "Ί" */
    0x59, 0x11, 0x11, 0x11, 0x11, 0x10,

    /* U+038C "Ό" */
    0x80, 0x4f, 0x8, 0x4c, 0x34, 0xa, 0x5, 0x2,
    0x81, 0x40, 0xb0, 0xc8, 0x43, 0xc0,

    /* U+038E "Ύ" */
    0xa0, 0xd8, 0xc4, 0x43, 0x60, 0xa0, 0x50, 0x10,
    0x8, 0x4, 0x2, 0x1, 0x0,

    /* U+038F "Ώ" */
    0x9c, 0xa2, 0x41, 0x41, 0x41, 0x41, 0x41, 0x41,
    0x42, 0x22, 0x77,

    /* U+0390 "ΐ" */
    0x35, 0x40, 0x2, 0x10, 0x84, 0x21, 0x8, 0x70,

    /* U+03AC "ά" */
    0x18, 0x20, 0x0, 0x7, 0x49, 0xa1, 0x42, 0x85,
    0xb, 0x33, 0xb0,

    /* U+03AD "έ" */
    0x10, 0x80, 0x1e, 0x8e, 0x7, 0x30, 0x82, 0x37,
    0x80,

    /* U+03AE "ή" */
    0x10, 0x40, 0x2e, 0xc6, 0x18, 0x61, 0x86, 0x18,
    0x41, 0x4, 0x10,

    /* U+03AF "ί" */
    0xa2, 0xaa, 0xac,

    /* U+03B0 "ΰ" */
    0x32, 0xa0, 0x0, 0x8a, 0x18, 0x61, 0x86, 0x18,
    0x9c,

    /* U+03CC "ό" */
    0x18, 0x20, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0,

    /* U+03CD "ύ" */
    0x30, 0x80, 0x23, 0x86, 0x18, 0x61, 0x86, 0x27,
    0x0,

    /* U+03CE "ώ" */
    0xc, 0x2, 0x0, 0x1, 0x2, 0x80, 0x62, 0x18,
    0x86, 0x21, 0x88, 0x77, 0x27, 0x78,

    /* U+0403 "Ѓ" */
    0x18, 0x42, 0x3f, 0x82, 0x8, 0x20, 0x82, 0x8,
    0x20, 0x82, 0x0,

    /* U+040C "Ќ" */
    0x18, 0x20, 0x84, 0x38, 0xd3, 0x24, 0x50, 0xf1,
    0xa2, 0x64, 0x68, 0x50, 0xc0,

    /* U+0453 "ѓ" */
    0x24, 0xf, 0x88, 0x88, 0x88, 0x80,

    /* U+045C "ќ" */
    0x10, 0x80, 0x23, 0x9a, 0x4a, 0x38, 0xb2, 0x68,
    0xc0,

    /* U+1E00 "Ḁ" */
    0xc, 0x7, 0x1, 0xc0, 0x58, 0x36, 0xc, 0x82,
    0x31, 0xfc, 0x61, 0x90, 0x24, 0x8, 0x30, 0x14,
    0x3, 0x0,

    /* U+1E01 "ḁ" */
    0x7b, 0x10, 0x5f, 0xc6, 0x18, 0xdd, 0x31, 0x43,
    0x0,

    /* U+1E3E "Ḿ" */
    0x2, 0x1, 0x0, 0x83, 0x3, 0xc0, 0xf0, 0x3a,
    0x16, 0x85, 0xb3, 0x64, 0x99, 0x26, 0x31, 0x8c,
    0x63, 0x10,

    /* U+1E3F "ḿ" */
    0x2, 0x0, 0x80, 0x0, 0x5c, 0xec, 0x63, 0x8,
    0x61, 0xc, 0x21, 0x84, 0x30, 0x86, 0x10, 0x80,

    /* U+1E82 "Ẃ" */
    0x1, 0x0, 0x30, 0x2, 0x4, 0x21, 0x46, 0x34,
    0x63, 0x45, 0x26, 0x52, 0x2d, 0x22, 0x96, 0x28,
    0xc2, 0x8c, 0x30, 0xc1, 0xc,

    /* U+1E83 "ẃ" */
    0x6, 0x1, 0x0, 0x3, 0x11, 0x4c, 0x53, 0x34,
    0xa9, 0xca, 0x32, 0x8c, 0x43, 0x10,

    /* U+1EA0 "Ạ" */
    0x8, 0x7, 0x1, 0xc0, 0x50, 0x16, 0xc, 0x82,
    0x30, 0xfc, 0x61, 0x10, 0x24, 0x8, 0x0, 0x8,
    0x0,

    /* U+1EA1 "ạ" */
    0x7b, 0x10, 0x5f, 0xc6, 0x18, 0xdd, 0x0, 0x80,

    /* U+1EA2 "Ả" */
    0xc, 0x1, 0x0, 0x80, 0x30, 0x1c, 0x7, 0x1,
    0x60, 0xd8, 0x32, 0x8, 0xc7, 0xf1, 0x86, 0x40,
    0x90, 0x20,

    /* U+1EA3 "ả" */
    0x18, 0x40, 0x0, 0x7b, 0x10, 0x5f, 0xc6, 0x18,
    0xdd,

    /* U+1EA4 "Ấ" */
    0x0, 0x80, 0x21, 0xd0, 0x8c, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EA5 "ấ" */
    0x3, 0x2, 0x30, 0x68, 0x0, 0x78, 0xc4, 0x4,
    0x7c, 0xc4, 0x84, 0x8c, 0x74,

    /* U+1EA6 "Ầ" */
    0xc0, 0x10, 0x3, 0xc0, 0x58, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EA7 "ầ" */
    0x80, 0xb0, 0xd0, 0x3, 0xc8, 0x40, 0x9f, 0x62,
    0x85, 0x19, 0xd0,

    /* U+1EA8 "Ẩ" */
    0x1, 0x0, 0x47, 0x42, 0x40, 0xc0, 0xe0, 0x70,
    0x2c, 0x36, 0x19, 0x8, 0xcf, 0xe6, 0x12, 0xd,
    0x2,

    /* U+1EA9 "ẩ" */
    0x6, 0x4, 0xf2, 0x40, 0xf, 0x31, 0x2, 0x7d,
    0x8a, 0x14, 0x67, 0x40,

    /* U+1EAA "Ẫ" */
    0x1a, 0x9, 0x0, 0x80, 0xd8, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EAB "ẫ" */
    0x29, 0x63, 0x12, 0x1, 0xec, 0x41, 0x7f, 0x18,
    0x63, 0x74,

    /* U+1EAC "Ậ" */
    0x8, 0x5, 0x1, 0x60, 0x20, 0x1c, 0x7, 0x1,
    0x40, 0x58, 0x32, 0x8, 0xc3, 0xf1, 0x84, 0x40,
    0x90, 0x20, 0x0, 0x20,

    /* U+1EAD "ậ" */
    0x31, 0x20, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40, 0x20,

    /* U+1EAE "Ắ" */
    0x4, 0x2, 0x1, 0x20, 0x70, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EAF "ắ" */
    0x11, 0x23, 0x80, 0x7a, 0x10, 0x5f, 0xc6, 0x18,
    0xdd,

    /* U+1EB0 "Ằ" */
    0x10, 0x2, 0x1, 0x20, 0x70, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EB1 "ằ" */
    0x21, 0x23, 0x80, 0x7a, 0x10, 0x5f, 0xc6, 0x18,
    0xdd,

    /* U+1EB2 "Ẳ" */
    0xc, 0x1, 0x0, 0x80, 0x8, 0x1c, 0x3, 0x1,
    0xc0, 0x70, 0x16, 0xd, 0x83, 0x20, 0x8c, 0x7f,
    0x18, 0x64, 0x9, 0x2,

    /* U+1EB3 "ẳ" */
    0x18, 0x44, 0x8e, 0x1, 0xe8, 0x41, 0x7f, 0x18,
    0x63, 0x74,

    /* U+1EB4 "Ẵ" */
    0x1a, 0x9, 0x80, 0x20, 0x70, 0xc, 0x7, 0x1,
    0xc0, 0x58, 0x36, 0xc, 0x82, 0x31, 0xfc, 0x61,
    0x90, 0x24, 0x8,

    /* U+1EB5 "ẵ" */
    0x29, 0x64, 0x8e, 0x1, 0xe8, 0x41, 0x7f, 0x18,
    0x63, 0x74,

    /* U+1EB6 "Ặ" */
    0x16, 0x7, 0x0, 0x80, 0x70, 0x1c, 0x5, 0x1,
    0x60, 0xc8, 0x23, 0xf, 0xc6, 0x11, 0x2, 0x40,
    0x80, 0x0, 0x80,

    /* U+1EB7 "ặ" */
    0x48, 0xe0, 0x1e, 0xc4, 0x17, 0xf1, 0x86, 0x37,
    0x40, 0x20,

    /* U+1EB8 "Ẹ" */
    0xfd, 0x2, 0x4, 0x8, 0x1f, 0xa0, 0x40, 0x81,
    0x3, 0xf8, 0x1, 0x0,

    /* U+1EB9 "ẹ" */
    0x3c, 0x8e, 0xf, 0xf8, 0x10, 0x10, 0x9e, 0x0,
    0x20,

    /* U+1EBA "Ẻ" */
    0x30, 0x43, 0x0, 0xfe, 0x8, 0x20, 0x83, 0xf8,
    0x20, 0x82, 0xf, 0xc0,

    /* U+1EBB "ẻ" */
    0x38, 0x40, 0x0, 0x39, 0x38, 0x7f, 0x82, 0x4,
    0x5e,

    /* U+1EBC "Ẽ" */
    0x78, 0xf, 0xe0, 0x82, 0x8, 0x3e, 0x82, 0x8,
    0x20, 0xfc,

    /* U+1EBD "ẽ" */
    0x69, 0x60, 0xe, 0x4e, 0x1f, 0xe0, 0x81, 0x17,
    0x80,

    /* U+1EBE "Ế" */
    0x2, 0x49, 0xd6, 0x4f, 0xd0, 0x20, 0x40, 0x81,
    0xf2, 0x4, 0x8, 0x10, 0x3f, 0x0,

    /* U+1EBF "ế" */
    0x2, 0x4, 0xd2, 0x40, 0x7, 0x13, 0x42, 0xfd,
    0x2, 0x2, 0x27, 0x80,

    /* U+1EC0 "Ề" */
    0x81, 0x1, 0x63, 0x27, 0xe8, 0x10, 0x20, 0x40,
    0xf9, 0x2, 0x4, 0x8, 0x1f, 0x80,

    /* U+1EC1 "ề" */
    0x81, 0x81, 0x61, 0x20, 0x3, 0x89, 0xa1, 0x7e,
    0x81, 0x1, 0x13, 0xc0,

    /* U+1EC2 "Ể" */
    0x4, 0x8, 0xd2, 0x4f, 0xd0, 0x20, 0x40, 0x81,
    0xf2, 0x4, 0x8, 0x10, 0x3f, 0x0,

    /* U+1EC3 "ể" */
    0x6, 0x4, 0xd2, 0x40, 0x7, 0x13, 0x42, 0xfd,
    0x2, 0x2, 0x27, 0x80,

    /* U+1EC4 "Ễ" */
    0x69, 0x42, 0x16, 0xfe, 0x8, 0x20, 0x83, 0xe8,
    0x20, 0x82, 0xf, 0xc0,

    /* U+1EC5 "ễ" */
    0x29, 0x63, 0x12, 0x0, 0xe4, 0xe1, 0xfe, 0x8,
    0x11, 0x78,

    /* U+1EC6 "Ệ" */
    0x10, 0x51, 0xa7, 0xe8, 0x10, 0x20, 0x40, 0xfd,
    0x2, 0x4, 0x8, 0x1f, 0xc0, 0x8,

    /* U+1EC7 "ệ" */
    0x10, 0xd8, 0x1, 0xe4, 0x70, 0x7f, 0xc0, 0x80,
    0x84, 0xf0, 0x1, 0x0,

    /* U+1EC8 "Ỉ" */
    0xd8, 0xaa, 0xaa, 0xa8,

    /* U+1EC9 "ỉ" */
    0xe0, 0xaa, 0xaa,

    /* U+1ECA "Ị" */
    0xff, 0xe8,

    /* U+1ECB "ị" */
    0x9f, 0xe8,

    /* U+1ECC "Ọ" */
    0x3c, 0x42, 0xc3, 0x81, 0x81, 0x81, 0x81, 0x81,
    0xc3, 0x42, 0x3c, 0x0, 0x10,

    /* U+1ECD "ọ" */
    0x38, 0x8a, 0xc, 0x18, 0x30, 0x51, 0x1c, 0x0,
    0x20,

    /* U+1ECE "Ỏ" */
    0x18, 0x4, 0x8, 0x0, 0x3c, 0x42, 0xc3, 0x81,
    0x81, 0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+1ECF "ỏ" */
    0x18, 0x20, 0x0, 0x3, 0x88, 0xa0, 0xc1, 0x83,
    0x5, 0x11, 0xc0,

    /* U+1ED0 "Ố" */
    0x1, 0x19, 0x3e, 0x66, 0x3c, 0x42, 0xc3, 0x81,
    0x81, 0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+1ED1 "ố" */
    0x1, 0x2, 0x3a, 0x6c, 0x0, 0x38, 0x44, 0x82,
    0x82, 0x82, 0x82, 0x44, 0x38,

    /* U+1ED2 "Ồ" */
    0x80, 0x98, 0x7c, 0x66, 0x3c, 0x42, 0xc3, 0x81,
    0x81, 0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+1ED3 "ồ" */
    0x80, 0x40, 0x5c, 0x36, 0x0, 0x1c, 0x22, 0x41,
    0x41, 0x41, 0x41, 0x22, 0x1c,

    /* U+1ED4 "Ổ" */
    0x2, 0x1, 0x1a, 0x24, 0x3c, 0x42, 0xc3, 0x81,
    0x81, 0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+1ED5 "ổ" */
    0x2, 0x4, 0xf2, 0x60, 0x7, 0x11, 0x41, 0x83,
    0x6, 0xa, 0x23, 0x80,

    /* U+1ED6 "Ỗ" */
    0x34, 0x2c, 0x18, 0x24, 0x3c, 0x42, 0xc3, 0x81,
    0x81, 0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c,

    /* U+1ED7 "ỗ" */
    0x24, 0xb0, 0xe3, 0x60, 0x7, 0x11, 0x41, 0x83,
    0x6, 0xa, 0x23, 0x80,

    /* U+1ED8 "Ộ" */
    0x10, 0x28, 0x2c, 0x3c, 0x42, 0xc3, 0x81, 0x81,
    0x81, 0x81, 0x81, 0xc3, 0x42, 0x3c, 0x0, 0x10,

    /* U+1ED9 "ộ" */
    0x10, 0xd0, 0x1, 0xc4, 0x50, 0x60, 0xc1, 0x82,
    0x88, 0xe0, 0x1, 0x0,

    /* U+1EDA "Ớ" */
    0x6, 0x6, 0x4, 0x27, 0x94, 0x36, 0x1a, 0x5,
    0x2, 0x81, 0x40, 0xa0, 0x58, 0x64, 0x21, 0xe0,

    /* U+1EDB "ớ" */
    0xc, 0x10, 0x1, 0x3a, 0x46, 0x82, 0x82, 0x82,
    0x82, 0x44, 0x38,

    /* U+1EDC "Ờ" */
    0x20, 0x8, 0x2, 0x27, 0x94, 0x36, 0x1a, 0x5,
    0x2, 0x81, 0x40, 0xa0, 0x58, 0x64, 0x21, 0xe0,

    /* U+1EDD "ờ" */
    0x60, 0x30, 0x1, 0x3a, 0x46, 0x82, 0x82, 0x82,
    0x82, 0x44, 0x38,

    /* U+1EDE "Ở" */
    0x8, 0x2, 0x2, 0x0, 0x13, 0xca, 0x1b, 0xd,
    0x2, 0x81, 0x40, 0xa0, 0x50, 0x2c, 0x32, 0x10,
    0xf0,

    /* U+1EDF "ở" */
    0x18, 0x10, 0x0, 0x2, 0x3a, 0x46, 0x82, 0x82,
    0x82, 0x82, 0x44, 0x38,

    /* U+1EE0 "Ỡ" */
    0x3e, 0x0, 0x4f, 0x28, 0x6c, 0x34, 0xa, 0x5,
    0x2, 0x81, 0x40, 0xb0, 0xc8, 0x43, 0xc0,

    /* U+1EE1 "ỡ" */
    0x74, 0x5c, 0x1, 0x3a, 0x46, 0x82, 0x82, 0x82,
    0x82, 0x44, 0x38,

    /* U+1EE2 "Ợ" */
    0x0, 0x9e, 0x50, 0xd8, 0x68, 0x14, 0xa, 0x5,
    0x2, 0x81, 0x61, 0x90, 0x87, 0x80, 0x0, 0x80,

    /* U+1EE3 "ợ" */
    0x2, 0x3a, 0x46, 0x82, 0x82, 0x82, 0x82, 0x44,
    0x38, 0x0, 0x10,

    /* U+1EE4 "Ụ" */
    0x83, 0x6, 0xc, 0x18, 0x30, 0x60, 0xc1, 0x82,
    0x88, 0xe0, 0x1, 0x0,

    /* U+1EE5 "ụ" */
    0x86, 0x18, 0x61, 0x86, 0x18, 0xdf, 0x0, 0x80,

    /* U+1EE6 "Ủ" */
    0x18, 0x10, 0x40, 0x8, 0x30, 0x60, 0xc1, 0x83,
    0x6, 0xc, 0x18, 0x28, 0x8e, 0x0,

    /* U+1EE7 "ủ" */
    0x38, 0xc0, 0x0, 0x86, 0x18, 0x61, 0x86, 0x18,
    0xdf,

    /* U+1EE8 "Ứ" */
    0xc, 0x2, 0x1, 0x2, 0x9, 0x82, 0x60, 0xe8,
    0x22, 0x8, 0x82, 0x20, 0x88, 0x22, 0x8, 0x44,
    0xe, 0x0,

    /* U+1EE9 "ứ" */
    0x18, 0x10, 0x1, 0x85, 0x86, 0x84, 0x84, 0x84,
    0x84, 0x8c, 0x7c,

    /* U+1EEA "Ừ" */
    0x60, 0xc, 0x1, 0x2, 0x9, 0x82, 0x60, 0xe8,
    0x22, 0x8, 0x82, 0x20, 0x88, 0x22, 0x8, 0x44,
    0xe, 0x0,

    /* U+1EEB "ừ" */
    0x60, 0x30, 0x1, 0x85, 0x86, 0x84, 0x84, 0x84,
    0x84, 0x8c, 0x7c,

    /* U+1EEC "Ử" */
    0x18, 0x2, 0x1, 0x0, 0x0, 0x82, 0x60, 0x98,
    0x3a, 0x8, 0x82, 0x20, 0x88, 0x22, 0x8, 0x82,
    0x11, 0x3, 0x80,

    /* U+1EED "ử" */
    0x30, 0x8, 0x10, 0x1, 0x85, 0x86, 0x84, 0x84,
    0x84, 0x84, 0x8c, 0x7c,

    /* U+1EEE "Ữ" */
    0x7c, 0x0, 0x8, 0x26, 0x9, 0x83, 0xa0, 0x88,
    0x22, 0x8, 0x82, 0x20, 0x88, 0x21, 0x10, 0x38,
    0x0,

    /* U+1EEF "ữ" */
    0x64, 0x98, 0x1, 0x85, 0x86, 0x84, 0x84, 0x84,
    0x84, 0x8c, 0x7c,

    /* U+1EF0 "Ự" */
    0x82, 0x60, 0x98, 0x3a, 0x8, 0x82, 0x20, 0x88,
    0x22, 0x8, 0x82, 0x11, 0x3, 0x80, 0x0, 0x10,
    0x0,

    /* U+1EF1 "ự" */
    0x1, 0x85, 0x86, 0x84, 0x84, 0x84, 0x84, 0x8c,
    0x7c, 0x0, 0x20,

    /* U+1EF2 "Ỳ" */
    0x20, 0x60, 0x44, 0x1c, 0x68, 0x9b, 0x14, 0x38,
    0x20, 0x40, 0x81, 0x2, 0x0,

    /* U+1EF3 "ỳ" */
    0x20, 0x40, 0x31, 0x45, 0x36, 0x8a, 0x28, 0xc1,
    0x4, 0x21, 0x80,

    /* U+1EF4 "Ỵ" */
    0x83, 0x8d, 0x13, 0x62, 0x87, 0x4, 0x8, 0x10,
    0x20, 0x40, 0x1, 0x0,

    /* U+1EF5 "ỵ" */
    0xc5, 0x24, 0x9a, 0x38, 0xc3, 0x4, 0x20, 0x8c,
    0x80,

    /* U+1EF6 "Ỷ" */
    0x18, 0x8, 0x10, 0x82, 0xc6, 0x44, 0x6c, 0x28,
    0x38, 0x10, 0x10, 0x10, 0x10, 0x10,

    /* U+1EF7 "ỷ" */
    0x18, 0x40, 0x0, 0xc5, 0x14, 0xda, 0x28, 0xe3,
    0x4, 0x10, 0x86, 0x0,

    /* U+1EF8 "Ỹ" */
    0x24, 0xb2, 0xe, 0x34, 0x4d, 0x8a, 0x1c, 0x10,
    0x20, 0x40, 0x81, 0x0,

    /* U+1EF9 "ỹ" */
    0x25, 0x60, 0x31, 0x45, 0x36, 0x8a, 0x28, 0xc1,
    0x4, 0x21, 0x80,

    /* U+1F4D "Ὅ" */
    0x93, 0xca, 0x42, 0xc, 0x30, 0x81, 0x8, 0x10,
    0x81, 0x8, 0x10, 0x81, 0xc, 0x30, 0x42, 0x3,
    0xc0,

    /* U+2010 "‐" */
    0xe0,

    /* U+2011 "‑" */
    0xe0,

    /* U+2013 "–" */
    0xfe,

    /* U+2014 "—" */
    0xff, 0x80,

    /* U+2018 "‘" */
    0x2a,

    /* U+2019 "’" */
    0x54,

    /* U+201C "“" */
    0xa, 0xaa,

    /* U+201D "”" */
    0x55, 0x50,

    /* U+2020 "†" */
    0x10, 0x20, 0x47, 0xf1, 0x2, 0x4, 0x8, 0x10,
    0x20, 0x40,

    /* U+2021 "‡" */
    0x10, 0x20, 0x47, 0xf1, 0x2, 0x4, 0x8, 0x10,
    0x23, 0xf8, 0x81, 0x2, 0x0,

    /* U+2026 "…" */
    0x92,

    /* U+2030 "‰" */
    0x60, 0x9, 0x20, 0x92, 0x9, 0x40, 0x64, 0x0,
    0x80, 0x13, 0x61, 0x49, 0x24, 0x92, 0x49, 0x3,
    0x60,

    /* U+2032 "′" */
    0xe0,

    /* U+2033 "″" */
    0xb6, 0x80};

/*---------------------
 *  GLYPH DESCRIPTION
 *--------------------*/

static const lv_font_fmt_txt_glyph_dsc_t glyph_dsc[] = {
    {.bitmap_index = 0, .adv_w = 0, .box_w = 0, .box_h = 0, .ofs_x = 0, .ofs_y = 0} /* id = 0 reserved */,
    {.bitmap_index = 0, .adv_w = 0, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1, .adv_w = 0, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2, .adv_w = 56, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 3, .adv_w = 56, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 4, .adv_w = 58, .box_w = 1, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 6, .adv_w = 72, .box_w = 3, .box_h = 3, .ofs_x = 1, .ofs_y = 8},
    {.bitmap_index = 8, .adv_w = 138, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 19, .adv_w = 126, .box_w = 6, .box_h = 15, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 31, .adv_w = 164, .box_w = 9, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 44, .adv_w = 139, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 55, .adv_w = 39, .box_w = 1, .box_h = 3, .ofs_x = 1, .ofs_y = 8},
    {.bitmap_index = 56, .adv_w = 77, .box_w = 3, .box_h = 15, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 62, .adv_w = 78, .box_w = 3, .box_h = 15, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 68, .adv_w = 96, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 72, .adv_w = 127, .box_w = 7, .box_h = 9, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 80, .adv_w = 44, .box_w = 2, .box_h = 4, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 81, .adv_w = 62, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 82, .adv_w = 59, .box_w = 1, .box_h = 1, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 83, .adv_w = 92, .box_w = 5, .box_h = 12, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 91, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 100, .adv_w = 126, .box_w = 4, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 106, .adv_w = 126, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 116, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 125, .adv_w = 126, .box_w = 7, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 135, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 144, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 153, .adv_w = 126, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 163, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 172, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 181, .adv_w = 54, .box_w = 1, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 182, .adv_w = 47, .box_w = 1, .box_h = 9, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 184, .adv_w = 114, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 190, .adv_w = 123, .box_w = 6, .box_h = 4, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 193, .adv_w = 117, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 199, .adv_w = 106, .box_w = 5, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 206, .adv_w = 201, .box_w = 11, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 226, .adv_w = 146, .box_w = 10, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 240, .adv_w = 140, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 250, .adv_w = 146, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 260, .adv_w = 147, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 270, .adv_w = 127, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 279, .adv_w = 124, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 288, .adv_w = 153, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 299, .adv_w = 160, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 310, .adv_w = 61, .box_w = 1, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 312, .adv_w = 124, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 321, .adv_w = 141, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 331, .adv_w = 121, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 340, .adv_w = 196, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 354, .adv_w = 160, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 365, .adv_w = 154, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 376, .adv_w = 141, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 386, .adv_w = 154, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 399, .adv_w = 138, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 409, .adv_w = 133, .box_w = 8, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 420, .adv_w = 134, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 430, .adv_w = 145, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 440, .adv_w = 143, .box_w = 9, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 453, .adv_w = 199, .box_w = 12, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 470, .adv_w = 140, .box_w = 8, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 481, .adv_w = 135, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 491, .adv_w = 134, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 501, .adv_w = 59, .box_w = 2, .box_h = 14, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 505, .adv_w = 92, .box_w = 6, .box_h = 12, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 514, .adv_w = 59, .box_w = 2, .box_h = 14, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 518, .adv_w = 94, .box_w = 5, .box_h = 6, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 522, .adv_w = 101, .box_w = 6, .box_h = 1, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 523, .adv_w = 69, .box_w = 3, .box_h = 2, .ofs_x = 0, .ofs_y = 9},
    {.bitmap_index = 524, .adv_w = 122, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 530, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 539, .adv_w = 117, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 545, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 554, .adv_w = 119, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 560, .adv_w = 78, .box_w = 5, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 567, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 576, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 585, .adv_w = 54, .box_w = 1, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 587, .adv_w = 54, .box_w = 3, .box_h = 14, .ofs_x = -1, .ofs_y = -3},
    {.bitmap_index = 593, .adv_w = 114, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 602, .adv_w = 54, .box_w = 1, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 604, .adv_w = 196, .box_w = 11, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 615, .adv_w = 124, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 621, .adv_w = 128, .box_w = 7, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 628, .adv_w = 126, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 637, .adv_w = 127, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 646, .adv_w = 76, .box_w = 3, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 649, .adv_w = 116, .box_w = 6, .box_h = 8, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 655, .adv_w = 73, .box_w = 3, .box_h = 10, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 659, .adv_w = 123, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 665, .adv_w = 109, .box_w = 7, .box_h = 8, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 672, .adv_w = 168, .box_w = 10, .box_h = 8, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 682, .adv_w = 111, .box_w = 7, .box_h = 8, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 689, .adv_w = 106, .box_w = 6, .box_h = 11, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 698, .adv_w = 111, .box_w = 6, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 704, .adv_w = 76, .box_w = 3, .box_h = 15, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 710, .adv_w = 55, .box_w = 1, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 712, .adv_w = 76, .box_w = 3, .box_h = 15, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 718, .adv_w = 152, .box_w = 8, .box_h = 3, .ofs_x = 1, .ofs_y = 3},
    {.bitmap_index = 721, .adv_w = 56, .box_w = 1, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 722, .adv_w = 55, .box_w = 1, .box_h = 10, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 724, .adv_w = 123, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 733, .adv_w = 130, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 743, .adv_w = 160, .box_w = 8, .box_h = 9, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 752, .adv_w = 118, .box_w = 7, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 762, .adv_w = 54, .box_w = 1, .box_h = 12, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 764, .adv_w = 137, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 777, .adv_w = 94, .box_w = 4, .box_h = 1, .ofs_x = 1, .ofs_y = 9},
    {.bitmap_index = 778, .adv_w = 176, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 792, .adv_w = 100, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 795, .adv_w = 105, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 799, .adv_w = 124, .box_w = 6, .box_h = 3, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 802, .adv_w = 62, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 803, .adv_w = 176, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 817, .adv_w = 103, .box_w = 5, .box_h = 1, .ofs_x = 1, .ofs_y = 9},
    {.bitmap_index = 818, .adv_w = 84, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 7},
    {.bitmap_index = 820, .adv_w = 120, .box_w = 6, .box_h = 9, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 827, .adv_w = 82, .box_w = 4, .box_h = 5, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 830, .adv_w = 82, .box_w = 4, .box_h = 5, .ofs_x = 0, .ofs_y = 5},
    {.bitmap_index = 833, .adv_w = 70, .box_w = 3, .box_h = 2, .ofs_x = 1, .ofs_y = 9},
    {.bitmap_index = 834, .adv_w = 127, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 843, .adv_w = 110, .box_w = 5, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 850, .adv_w = 59, .box_w = 1, .box_h = 1, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 851, .adv_w = 56, .box_w = 2, .box_h = 3, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 852, .adv_w = 82, .box_w = 2, .box_h = 5, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 854, .adv_w = 102, .box_w = 5, .box_h = 5, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 858, .adv_w = 105, .box_w = 5, .box_h = 6, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 862, .adv_w = 164, .box_w = 9, .box_h = 10, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 874, .adv_w = 174, .box_w = 9, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 887, .adv_w = 174, .box_w = 10, .box_h = 10, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 900, .adv_w = 106, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 909, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 927, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 945, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 963, .adv_w = 146, .box_w = 10, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 980, .adv_w = 146, .box_w = 10, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 997, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1015, .adv_w = 209, .box_w = 13, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1033, .adv_w = 146, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1047, .adv_w = 127, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1058, .adv_w = 127, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1069, .adv_w = 127, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1080, .adv_w = 127, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1090, .adv_w = 61, .box_w = 2, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1094, .adv_w = 61, .box_w = 2, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1098, .adv_w = 61, .box_w = 3, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1104, .adv_w = 61, .box_w = 4, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1111, .adv_w = 150, .box_w = 8, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1122, .adv_w = 160, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1135, .adv_w = 154, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1149, .adv_w = 154, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1163, .adv_w = 154, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1177, .adv_w = 154, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1190, .adv_w = 154, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1203, .adv_w = 120, .box_w = 6, .box_h = 7, .ofs_x = 1, .ofs_y = 1},
    {.bitmap_index = 1209, .adv_w = 154, .box_w = 8, .box_h = 12, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 1221, .adv_w = 145, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1234, .adv_w = 145, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1247, .adv_w = 145, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1260, .adv_w = 145, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1272, .adv_w = 135, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1285, .adv_w = 132, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1294, .adv_w = 133, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1304, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1313, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1322, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1331, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1340, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1349, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1358, .adv_w = 189, .box_w = 10, .box_h = 8, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1368, .adv_w = 117, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1377, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1386, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1395, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1404, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1413, .adv_w = 55, .box_w = 2, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1416, .adv_w = 55, .box_w = 3, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1421, .adv_w = 55, .box_w = 3, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1426, .adv_w = 55, .box_w = 4, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1432, .adv_w = 131, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1441, .adv_w = 124, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1450, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1460, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1470, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1480, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1490, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1500, .adv_w = 128, .box_w = 7, .box_h = 7, .ofs_x = 1, .ofs_y = 2},
    {.bitmap_index = 1507, .adv_w = 127, .box_w = 7, .box_h = 10, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 1516, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1525, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1534, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1543, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1552, .adv_w = 106, .box_w = 6, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 1563, .adv_w = 129, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1574, .adv_w = 106, .box_w = 6, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 1585, .adv_w = 146, .box_w = 10, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1602, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1611, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 1629, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1638, .adv_w = 146, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1651, .adv_w = 117, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1660, .adv_w = 150, .box_w = 8, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1671, .adv_w = 134, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1681, .adv_w = 127, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1692, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1701, .adv_w = 61, .box_w = 5, .box_h = 13, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 1710, .adv_w = 55, .box_w = 5, .box_h = 11, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 1717, .adv_w = 121, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1728, .adv_w = 54, .box_w = 3, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1734, .adv_w = 160, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1748, .adv_w = 124, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1757, .adv_w = 138, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1770, .adv_w = 76, .box_w = 4, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1776, .adv_w = 133, .box_w = 8, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1790, .adv_w = 116, .box_w = 6, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1799, .adv_w = 145, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1811, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1820, .adv_w = 145, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1833, .adv_w = 123, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 1842, .adv_w = 134, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1855, .adv_w = 111, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1864, .adv_w = 154, .box_w = 9, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1878, .adv_w = 128, .box_w = 8, .box_h = 9, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1887, .adv_w = 156, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1901, .adv_w = 139, .box_w = 8, .box_h = 9, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1910, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1928, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1937, .adv_w = 209, .box_w = 13, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1960, .adv_w = 189, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 1974, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 1989, .adv_w = 127, .box_w = 7, .box_h = 12, .ofs_x = 1, .ofs_y = -1},
    {.bitmap_index = 2000, .adv_w = 0, .box_w = 3, .box_h = 2, .ofs_x = -5, .ofs_y = 9},
    {.bitmap_index = 2001, .adv_w = 0, .box_w = 5, .box_h = 2, .ofs_x = -6, .ofs_y = 9},
    {.bitmap_index = 2003, .adv_w = 0, .box_w = 2, .box_h = 3, .ofs_x = -4, .ofs_y = 9},
    {.bitmap_index = 2004, .adv_w = 0, .box_w = 1, .box_h = 1, .ofs_x = -5, .ofs_y = -2},
    {.bitmap_index = 2005, .adv_w = 113, .box_w = 5, .box_h = 3, .ofs_x = 1, .ofs_y = 9},
    {.bitmap_index = 2007, .adv_w = 146, .box_w = 10, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2021, .adv_w = 138, .box_w = 9, .box_h = 11, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 2034, .adv_w = 171, .box_w = 10, .box_h = 11, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 2048, .adv_w = 72, .box_w = 4, .box_h = 11, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 2054, .adv_w = 156, .box_w = 9, .box_h = 12, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2068, .adv_w = 145, .box_w = 9, .box_h = 11, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 2081, .adv_w = 151, .box_w = 8, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2092, .adv_w = 73, .box_w = 5, .box_h = 12, .ofs_x = -1, .ofs_y = 0},
    {.bitmap_index = 2100, .adv_w = 127, .box_w = 7, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2111, .adv_w = 121, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2120, .adv_w = 127, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 2131, .adv_w = 73, .box_w = 2, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2134, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2143, .adv_w = 128, .box_w = 7, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2153, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2162, .adv_w = 185, .box_w = 10, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2176, .adv_w = 125, .box_w = 6, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2187, .adv_w = 141, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2200, .adv_w = 94, .box_w = 4, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2206, .adv_w = 121, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2215, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 2233, .adv_w = 122, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = -3},
    {.bitmap_index = 2242, .adv_w = 196, .box_w = 10, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2260, .adv_w = 196, .box_w = 11, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2276, .adv_w = 199, .box_w = 12, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2297, .adv_w = 168, .box_w = 10, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2311, .adv_w = 146, .box_w = 10, .box_h = 13, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 2328, .adv_w = 122, .box_w = 6, .box_h = 10, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2336, .adv_w = 146, .box_w = 10, .box_h = 14, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2354, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2363, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2382, .adv_w = 122, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2395, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2414, .adv_w = 122, .box_w = 7, .box_h = 12, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2425, .adv_w = 146, .box_w = 9, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2442, .adv_w = 122, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2454, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2473, .adv_w = 122, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2483, .adv_w = 146, .box_w = 10, .box_h = 16, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 2503, .adv_w = 122, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2513, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2532, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2541, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2560, .adv_w = 122, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2569, .adv_w = 146, .box_w = 10, .box_h = 16, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2589, .adv_w = 122, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2599, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2618, .adv_w = 122, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2628, .adv_w = 146, .box_w = 10, .box_h = 15, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 2647, .adv_w = 122, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2657, .adv_w = 127, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2669, .adv_w = 119, .box_w = 7, .box_h = 10, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2678, .adv_w = 127, .box_w = 6, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2690, .adv_w = 119, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2699, .adv_w = 127, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2709, .adv_w = 119, .box_w = 6, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2718, .adv_w = 127, .box_w = 7, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2732, .adv_w = 119, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2744, .adv_w = 127, .box_w = 7, .box_h = 15, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2758, .adv_w = 119, .box_w = 7, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2770, .adv_w = 127, .box_w = 7, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2784, .adv_w = 119, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2796, .adv_w = 127, .box_w = 6, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2808, .adv_w = 119, .box_w = 6, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2818, .adv_w = 127, .box_w = 7, .box_h = 16, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2832, .adv_w = 119, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2844, .adv_w = 61, .box_w = 2, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2848, .adv_w = 55, .box_w = 2, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2851, .adv_w = 61, .box_w = 1, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2853, .adv_w = 54, .box_w = 1, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2855, .adv_w = 154, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2868, .adv_w = 128, .box_w = 7, .box_h = 10, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 2877, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2892, .adv_w = 128, .box_w = 7, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2903, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2918, .adv_w = 128, .box_w = 8, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2931, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2946, .adv_w = 128, .box_w = 8, .box_h = 13, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 2959, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2974, .adv_w = 128, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 2986, .adv_w = 154, .box_w = 8, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3001, .adv_w = 128, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3013, .adv_w = 154, .box_w = 8, .box_h = 16, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3029, .adv_w = 128, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3041, .adv_w = 154, .box_w = 9, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3057, .adv_w = 128, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3068, .adv_w = 154, .box_w = 9, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3084, .adv_w = 128, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3095, .adv_w = 154, .box_w = 9, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3112, .adv_w = 128, .box_w = 8, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3124, .adv_w = 154, .box_w = 9, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3139, .adv_w = 128, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3150, .adv_w = 154, .box_w = 9, .box_h = 14, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3166, .adv_w = 128, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3177, .adv_w = 145, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3189, .adv_w = 123, .box_w = 6, .box_h = 10, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3197, .adv_w = 145, .box_w = 7, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3211, .adv_w = 123, .box_w = 6, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3220, .adv_w = 156, .box_w = 10, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3238, .adv_w = 139, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3249, .adv_w = 156, .box_w = 10, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3267, .adv_w = 139, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3278, .adv_w = 156, .box_w = 10, .box_h = 15, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3297, .adv_w = 139, .box_w = 8, .box_h = 12, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3309, .adv_w = 156, .box_w = 10, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3326, .adv_w = 139, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3337, .adv_w = 156, .box_w = 10, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3354, .adv_w = 139, .box_w = 8, .box_h = 11, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3365, .adv_w = 135, .box_w = 7, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3378, .adv_w = 106, .box_w = 6, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 3389, .adv_w = 135, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = -2},
    {.bitmap_index = 3401, .adv_w = 106, .box_w = 6, .box_h = 11, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 3410, .adv_w = 135, .box_w = 8, .box_h = 14, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3424, .adv_w = 106, .box_w = 6, .box_h = 15, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 3436, .adv_w = 135, .box_w = 7, .box_h = 13, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3448, .adv_w = 106, .box_w = 6, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 3459, .adv_w = 162, .box_w = 12, .box_h = 11, .ofs_x = -3, .ofs_y = 0},
    {.bitmap_index = 3476, .adv_w = 62, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 3477, .adv_w = 62, .box_w = 3, .box_h = 1, .ofs_x = 1, .ofs_y = 4},
    {.bitmap_index = 3478, .adv_w = 147, .box_w = 7, .box_h = 1, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 3479, .adv_w = 175, .box_w = 9, .box_h = 1, .ofs_x = 1, .ofs_y = 5},
    {.bitmap_index = 3481, .adv_w = 45, .box_w = 2, .box_h = 4, .ofs_x = 1, .ofs_y = 8},
    {.bitmap_index = 3482, .adv_w = 45, .box_w = 2, .box_h = 4, .ofs_x = 0, .ofs_y = 7},
    {.bitmap_index = 3483, .adv_w = 79, .box_w = 4, .box_h = 4, .ofs_x = 1, .ofs_y = 8},
    {.bitmap_index = 3485, .adv_w = 80, .box_w = 4, .box_h = 4, .ofs_x = 0, .ofs_y = 7},
    {.bitmap_index = 3487, .adv_w = 124, .box_w = 7, .box_h = 11, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 3497, .adv_w = 128, .box_w = 7, .box_h = 14, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 3510, .adv_w = 150, .box_w = 7, .box_h = 1, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3511, .adv_w = 215, .box_w = 12, .box_h = 11, .ofs_x = 1, .ofs_y = 0},
    {.bitmap_index = 3528, .adv_w = 39, .box_w = 1, .box_h = 3, .ofs_x = 1, .ofs_y = 8},
    {.bitmap_index = 3529, .adv_w = 72, .box_w = 3, .box_h = 3, .ofs_x = 1, .ofs_y = 8}};

/*---------------------
 *  CHARACTER MAPPING
 *--------------------*/

static const uint16_t unicode_list_0[] = {
    0x0, 0x2, 0xd};

static const uint16_t unicode_list_3[] = {
    0x0, 0x1, 0x2, 0x3, 0x4, 0x5, 0xe, 0xf,
    0x16, 0x17, 0x26, 0x27, 0x37, 0x38, 0x41, 0x42,
    0x52, 0x53, 0x58, 0x59, 0x66, 0x67, 0x70, 0x71,
    0x77, 0x78, 0x9e, 0x9f, 0xad, 0xae, 0xf8, 0xf9,
    0xfa, 0xfb, 0xfc, 0xfd, 0x1ff, 0x201, 0x207, 0x221,
    0x283, 0x284, 0x286, 0x287, 0x288, 0x28a, 0x28c, 0x28d,
    0x28e, 0x2aa, 0x2ab, 0x2ac, 0x2ad, 0x2ae, 0x2ca, 0x2cb,
    0x2cc, 0x301, 0x30a, 0x351, 0x35a, 0x1cfe, 0x1cff, 0x1d3c,
    0x1d3d, 0x1d80, 0x1d81};

static const uint16_t unicode_list_5[] = {
    0x0, 0xc3, 0xc4, 0xc6, 0xc7, 0xcb, 0xcc, 0xcf,
    0xd0, 0xd3, 0xd4, 0xd9, 0xe3, 0xe5, 0xe6};

/*Collect the unicode lists and glyph_id offsets*/
static const lv_font_fmt_txt_cmap_t cmaps[] =
    {
        {.range_start = 0, .range_length = 14, .glyph_id_start = 1, .unicode_list = unicode_list_0, .glyph_id_ofs_list = NULL, .list_length = 3, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY},
        {.range_start = 32, .range_length = 95, .glyph_id_start = 4, .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY},
        {.range_start = 160, .range_length = 96, .glyph_id_start = 99, .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY},
        {.range_start = 258, .range_length = 7554, .glyph_id_start = 195, .unicode_list = unicode_list_3, .glyph_id_ofs_list = NULL, .list_length = 67, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY},
        {.range_start = 7840, .range_length = 90, .glyph_id_start = 262, .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY},
        {.range_start = 8013, .range_length = 231, .glyph_id_start = 352, .unicode_list = unicode_list_5, .glyph_id_ofs_list = NULL, .list_length = 15, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY}};

/*-----------------
 *    KERNING
 *----------------*/

/*Map glyph_ids to kern left classes*/
static const uint8_t kern_left_class_mapping[] =
    {
        0, 0, 0, 0, 1, 0, 2, 0,
        0, 0, 0, 2, 3, 0, 0, 0,
        4, 0, 4, 5, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 6, 7, 8,
        9, 10, 11, 0, 12, 12, 13, 14,
        15, 12, 12, 9, 16, 17, 18, 0,
        19, 13, 20, 21, 22, 23, 24, 25,
        0, 0, 0, 0, 0, 26, 27, 28,
        0, 29, 30, 0, 31, 0, 0, 32,
        0, 31, 31, 33, 27, 0, 34, 0,
        35, 0, 36, 37, 38, 36, 39, 40,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 6, 6, 6, 6, 6,
        6, 0, 8, 10, 10, 10, 10, 12,
        12, 12, 12, 9, 12, 9, 9, 9,
        9, 9, 0, 0, 13, 13, 13, 13,
        23, 0, 0, 26, 26, 26, 26, 26,
        26, 0, 28, 29, 29, 29, 29, 0,
        0, 0, 0, 0, 31, 33, 33, 33,
        33, 33, 0, 0, 0, 0, 0, 0,
        36, 27, 36, 6, 26, 6, 26, 8,
        28, 9, 0, 10, 29, 12, 0, 15,
        0, 12, 31, 0, 34, 0, 0, 13,
        0, 13, 0, 24, 39, 0, 0, 0,
        0, 6, 26, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 6, 10, 12, 12,
        9, 23, 0, 0, 0, 0, 31, 0,
        0, 33, 0, 0, 41, 14, 38, 0,
        6, 26, 12, 31, 21, 0, 6, 26,
        6, 26, 6, 26, 6, 26, 6, 26,
        6, 26, 6, 26, 6, 26, 6, 26,
        6, 26, 6, 26, 6, 26, 10, 29,
        10, 29, 10, 29, 10, 29, 10, 29,
        10, 29, 10, 29, 10, 29, 12, 0,
        12, 0, 9, 33, 9, 33, 9, 33,
        9, 33, 9, 33, 9, 33, 9, 33,
        0, 0, 0, 0, 0, 0, 0, 33,
        0, 0, 13, 0, 13, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        23, 36, 23, 36, 23, 36, 23, 36,
        9, 0, 0, 0, 0, 2, 2, 2,
        2, 0, 0, 4, 0, 2, 2};

/*Map glyph_ids to kern right classes*/
static const uint8_t kern_right_class_mapping[] =
    {
        0, 0, 0, 0, 1, 0, 2, 0,
        0, 0, 3, 2, 0, 4, 5, 0,
        6, 7, 6, 8, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 9, 0, 10, 0, 11,
        0, 0, 0, 11, 0, 0, 12, 0,
        0, 0, 0, 11, 0, 11, 0, 13,
        14, 15, 16, 17, 18, 19, 20, 0,
        0, 21, 0, 0, 0, 22, 0, 23,
        23, 23, 24, 23, 0, 0, 0, 0,
        0, 25, 25, 26, 25, 23, 27, 28,
        29, 30, 31, 32, 33, 31, 34, 0,
        0, 35, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 36, 0,
        7, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 37, 0,
        0, 0, 0, 10, 10, 10, 10, 10,
        10, 38, 11, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 11, 11, 11,
        11, 11, 0, 11, 15, 15, 15, 15,
        19, 0, 0, 22, 22, 22, 22, 22,
        22, 39, 23, 23, 23, 23, 23, 0,
        0, 0, 0, 0, 25, 26, 26, 26,
        26, 26, 0, 40, 30, 30, 30, 30,
        31, 0, 31, 10, 22, 10, 22, 11,
        23, 0, 0, 0, 23, 0, 0, 0,
        0, 0, 25, 0, 0, 13, 28, 15,
        30, 15, 30, 20, 34, 11, 23, 41,
        30, 10, 22, 0, 0, 11, 0, 0,
        0, 0, 0, 0, 10, 0, 0, 0,
        11, 19, 0, 0, 23, 0, 25, 0,
        30, 26, 30, 0, 0, 0, 25, 25,
        10, 22, 0, 25, 17, 0, 10, 22,
        10, 22, 10, 22, 10, 22, 10, 22,
        10, 22, 10, 22, 10, 22, 10, 22,
        10, 22, 10, 22, 10, 22, 0, 23,
        0, 23, 0, 23, 0, 23, 0, 23,
        0, 23, 0, 23, 0, 23, 0, 0,
        0, 0, 11, 26, 11, 26, 11, 26,
        11, 26, 11, 26, 11, 26, 11, 26,
        11, 23, 11, 23, 11, 23, 11, 26,
        11, 23, 15, 30, 15, 30, 0, 30,
        0, 30, 0, 30, 0, 30, 0, 30,
        19, 31, 19, 31, 19, 31, 19, 31,
        0, 0, 0, 7, 7, 2, 42, 2,
        2, 0, 0, 6, 0, 2, 2};

/*Kern values between classes*/
static const int8_t kern_class_values[] =
    {
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -4, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -12, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -12, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 2, 2, 0, 2, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, -19,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, -19,
        0, 0, 0, 0, 0, 0, 0, -24,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -13, 0, 0, 0, 0,
        0, 0, -7, 0, -1, 0, 0, -14,
        -2, -10, -8, 0, -10, 0, 0, 0,
        0, 0, 0, -1, 0, 0, -2, -1,
        -5, -4, 0, 1, 0, 0, 0, 0,
        0, 0, -2, -13, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -3, 0, -3, 0, 0, -6, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -3, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -3, 0, 0, 0, 0,
        0, 0, -1, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -2, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -11, 0, 0,
        0, -2, 0, 0, 0, -3, 0, -2,
        0, -2, -5, -3, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -4, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 2,
        0, 0, 0, 0, 0, 0, 0, 0,
        -2, -2, 0, -2, 0, 0, 0, -2,
        -3, -2, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -26, 0, 0, 0, -19, 0, -29,
        0, 2, 0, 0, 0, 0, 0, 0,
        0, -4, -2, 0, 0, -2, -3, 0,
        0, -2, -3, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 2,
        0, 0, 0, -3, 0, 0, 0, 2,
        -3, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -2, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -7, 0, 0, 0, -3, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -3, 0, -3, -3, 0, 0, 0, -3,
        -4, -7, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 2, -7, 0,
        0, -30, -6, -19, -16, 0, -26, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -5, -15, -10, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -35, 0, 0, 0, -15,
        0, -22, 0, 0, 0, 0, 0, -3,
        0, -3, 0, -1, -1, 0, 0, -1,
        0, 0, 2, 0, 2, 0, 0, 0,
        0, 0, 0, -11, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -5, 0, -3,
        -2, 0, -4, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, -9,
        0, -2, 0, 0, -5, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, -4, 0, 0, 0,
        0, -24, -25, 0, 0, -9, -3, -26,
        -2, 2, 0, 2, 2, 0, 2, 0,
        0, -12, -11, 0, -12, -11, -8, -13,
        0, -10, -8, -6, -8, -7, 0, -36,
        -24, -20, -12, -10, 0, 0, 0, 0,
        0, 2, 0, -25, -4, 0, 0, -8,
        -1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 2, -5, -5, 0, 0, -5,
        -3, 0, 0, -3, -1, 0, 0, 0,
        2, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 2, 0, -13, -7, 0,
        0, -5, 0, 0, 0, 2, 0, 0,
        0, 0, 0, 0, 1, -4, -3, 0,
        0, -3, -2, 0, 0, -2, 0, 0,
        0, 0, 2, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -5, 0, 0, 0, -3, 0, 0, 0,
        0, 2, 0, 0, 0, 0, 0, 0,
        -3, 0, 0, -2, 0, 0, 0, -2,
        -3, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, -3, 2,
        -5, -23, -6, 0, 0, -10, -3, -10,
        -2, 2, -10, 2, 2, 1, 2, 0,
        2, -8, -7, -2, -4, -7, -4, -6,
        -2, -4, -2, 0, -3, -3, 2, -9,
        -6, -10, -7, -7, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 1,
        -3, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, -2, 0, 0, -2,
        0, 0, 0, -2, -3, -3, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -2, 0, 0, -2, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -7, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -2, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -7, 0, -3, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, -1, 0, -2, -2, 0, 0,
        0, 0, 0, 0, 0, -3, 0, -1,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, -1,
        0, -2, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, -1, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -9, 0, 2, 0, 2, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 2, 0,
        -3, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 2, 0, 0, 0,
        0, 0, 0, 2, 0, -11, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -9, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, -2, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -15, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, -2, 0,
        -2, -2, 0, 0, 0, 0, 0, 0,
        0, -9, 0, 2, 0, 0, 0, -13,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, -4,
        -2, 2, 0, -2, 0, 0, 5, 0,
        2, 2, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 2, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -2, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 2,
        0, 0, 0, -12, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, -2, -1, 1, 0, -2,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 2,
        0, 0, 0, 0, 0, -14, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        -2, 0, 0, -2, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, -2, 0, 0, -2, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, -2, 0, 0, -2, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, -43, -45, 0,
        0, -21, -7, 0, -5, 1, 0, 1,
        1, 0, 1, 0, 0, -23, -21, 0,
        -22, -21, -16, -24, 0, -20, -16, -13,
        -16, -13, 0, -63, -42, -35, -23, -20,
        0, 0};

/*Collect the kern class' data in one place*/
static const lv_font_fmt_txt_kern_classes_t kern_classes =
    {
        .class_pair_values = kern_class_values,
        .left_class_mapping = kern_left_class_mapping,
        .right_class_mapping = kern_right_class_mapping,
        .left_class_cnt = 41,
        .right_class_cnt = 42,
};

/*--------------------
 *  ALL CUSTOM DATA
 *--------------------*/

#if LVGL_VERSION_MAJOR == 8
/*Store all the custom data of the font*/
static lv_font_fmt_txt_glyph_cache_t cache;
#endif

#if LVGL_VERSION_MAJOR >= 8
static const lv_font_fmt_txt_dsc_t font_dsc = {
#else
static lv_font_fmt_txt_dsc_t font_dsc = {
#endif
    .glyph_bitmap = glyph_bitmap,
    .glyph_dsc = glyph_dsc,
    .cmaps = cmaps,
    .kern_dsc = &kern_classes,
    .kern_scale = 16,
    .cmap_num = 6,
    .bpp = 1,
    .kern_classes = 1,
    .bitmap_format = 0,
#if LVGL_VERSION_MAJOR == 8
    .cache = &cache
#endif

};

/*-----------------
 *  PUBLIC FONT
 *----------------*/

/*Initialize a public general font descriptor*/
#if LVGL_VERSION_MAJOR >= 8
const lv_font_t roboto_regular_14 = {
#else
lv_font_t roboto_regular_14 = {
#endif
    .get_glyph_dsc = lv_font_get_glyph_dsc_fmt_txt, /*Function pointer to get glyph's data*/
    .get_glyph_bitmap = lv_font_get_bitmap_fmt_txt, /*Function pointer to get glyph's bitmap*/
    .line_height = 19,                              /*The maximum line height required by the font*/
    .base_line = 3,                                 /*Baseline measured from the bottom of the line*/
#if !(LVGL_VERSION_MAJOR == 6 && LVGL_VERSION_MINOR == 0)
    .subpx = LV_FONT_SUBPX_NONE,
#endif
#if LV_VERSION_CHECK(7, 4, 0) || LVGL_VERSION_MAJOR >= 8
    .underline_position = -1,
    .underline_thickness = 1,
#endif

    .dsc = &font_dsc, /*The custom font data. Will be accessed by `get_glyph_bitmap/dsc` */
#if LV_VERSION_CHECK(8, 2, 0) || LVGL_VERSION_MAJOR >= 9
    .fallback = NULL,
#endif
    .user_data = NULL,
};

#endif /*#if ROBOTO_REGULAR_14*/
